export default function PrivacyPolicy() {
  return (
    <div className="bg-customPink px-4 sm:px-[50px]">
      <div className="mx-auto overflow-hidden px-4 sm:px-6 lg:px-8 py-10 bg-white">
        <h1 className="text-4xl font-bold mb-6 text-center">
          개인정보 취급방침
        </h1>

        <p className="text-gray-600 mb-4">
          인사이드 아웃(InsideOut, 이하 &lsquo;회사&rsquo;라 함)는 고객님의
          개인정보를 중요시하며, &ldquo;정보통신망 이용촉진 및 정보보호&rdquo;에
          관한 법률을 준수하고 있습니다. 회사는 개인정보취급방침을 통하여
          고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고
          있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지
          알려드립니다. 회사는 개인정보취급방침을 개정하는 경우 웹사이트
          공지사항(또는 개별공지)을 통하여 공지할 것입니다. 본
          개인정보취급방침은 회사가 제공하는 인사이드 아웃(InsideOut) 서비스
          이용에 적용되며 다음과 같은 내용을 담고 있습니다.
        </p>

        <p className="text-sm text-gray-500">
          본 방침은 2025년 1월 22일부터 시행됩니다.
        </p>

        <section className="space-y-4">
          <h2 className="text-2xl font-semibold mt-6">
            수집하는 개인정보 항목
          </h2>
          <p>
            회사는 회원가입, 상담, 서비스 신청 등을 위해 아래와 같은 개인정보를
            수집하고 있습니다.
          </p>
          <ul className="list-disc list-inside ml-4">
            <li>
              수집항목: 접속 지역, 서비스 이용기록, 접속 로그, 쿠키, 접속 IP
              정보
            </li>
            <li>개인정보 수집방법: 홈페이지(회원가입)</li>
          </ul>

          <h2 className="text-2xl font-semibold mt-6">
            개인정보의 수집 및 이용목적
          </h2>
          <p>회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.</p>
          <ul className="list-disc list-inside ml-4">
            <li>
              회원 관리: 회원제 서비스 이용에 따른 본인확인, 개인 식별,
              불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인,
              연령확인
            </li>
            <li>
              마케팅 및 광고에 활용: 신규 서비스(제품) 개발 및 특화, 이벤트 등
              광고성 정보 전달, 인구통계학적 특성에 따른 서비스 제공 및 광고
              게재, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-6">
            개인정보의 보유 및 이용기간
          </h2>
          <p>
            원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를
            지체 없이 파기합니다.
          </p>
          <ul className="list-disc list-inside ml-4"></ul>

          <h2 className="text-2xl font-semibold mt-6">
            개인정보의 파기절차 및 방법
          </h2>
          <p>
            회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당
            정보를 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.
          </p>
          <ul className="list-disc list-inside ml-4">
            <li>
              파기절차: 회원님이 회원가입 등을 위해 입력하신 정보는 목적이
              달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한
              정보보호 사유에 따라 일정 기간 저장된 후 파기됩니다.
            </li>
            <li>
              파기방법: 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수
              없는 기술적 방법을 사용하여 삭제합니다.
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-6">개인정보 제공</h2>
          <p>
            회사는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다.
            다만, 아래의 경우에는 예외로 합니다.
          </p>
          <ul className="list-disc list-inside ml-4">
            <li>이용자들이 사전에 동의한 경우</li>
            <li>
              법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와
              방법에 따라 수사기관의 요구가 있는 경우
            </li>
          </ul>

          <h2 className="text-2xl font-semibold mt-6">
            수집한 개인정보의 위탁
          </h2>
          <p>
            회사는 고객님의 동의 없이 고객님의 정보를 외부 업체에 위탁하지
            않습니다. 향후 그러한 필요가 생길 경우, 위탁 대상자와 위탁 업무
            내용에 대해 고객님에게 통지하고 필요한 경우 사전 동의를 받도록
            하겠습니다.
          </p>

          <h2 className="text-2xl font-semibold mt-6">
            이용자 및 법정대리인의 권리와 그 행사방법
          </h2>
          <p>
            이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할
            수 있으며 가입 해지를 요청할 수도 있습니다.
          </p>
          <p>
            개인정보관리책임자에게 이메일로 연락하시면 지체 없이 조치하겠습니다.
          </p>

          <h2 className="text-2xl font-semibold mt-6">
            개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항
          </h2>
          <p>
            회사는 귀하의 정보를 수시로 저장하고 찾아내는
            &lsquo;쿠키(cookie)&rsquo; 등을 운용합니다. 쿠키란 회사의 웹사이트를
            운영하는데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트
            파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다. 회사는 다음과 같은
            목적을 위해 쿠키를 사용합니다.
          </p>
          <p>
            ▶ 쿠키 등 사용 목적: 회원과 비회원의 접속 빈도나 방문 시간 등을
            분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여
            정도 및 방문 회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스
            제공
          </p>

          <h2 className="text-2xl font-semibold mt-6">
            개인정보에 관한 민원서비스
          </h2>
          <p>
            회사는 고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기
            위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고
            있습니다.
          </p>
          <p>담당자: 감정본부 개인정보보호책임자</p>
          <p>이메일: emotionhq11@gmail.com</p>
          <p>
            귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호
            관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다.
            회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴
            것입니다.
          </p>
          <p>
            기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에
            문의하시기 바랍니다. <br />
            1. 개인분쟁조정위원회 (www.1336.or.kr/1336) <br />
            2. 정보보호마크인증위원회 (www.eprivacy.or.kr/02-580-0533~4) <br />
            3. 대검찰청 인터넷범죄수사센터 (http://icic.sppo.go.kr/02-3480-3600){' '}
            <br />
            4. 경찰청 사이버테러대응센터 (www.ctrc.go.kr/02-392-0330)
          </p>
        </section>
      </div>
    </div>
  );
}
